t21/Walnut_X/Packages/.cache/Keil.Kinetis_KEAxx_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KEAxx_DFP</name>
  <description>Freescale Kinetis KEAxx Series Device Support and Examples</description>

  <releases>
    <release version="1.2.0" date="2015-02-12">
      Added TRK-KEA boards and examples.
      Reworked conditions, startup.
    </release>
    <release version="1.1.0" date="2014-08-28">
      Corrected memory settings for SRAM to form a single contiguous region.
      Udpated CMSIS-Core files to latest version from Freescale.
    </release>
    <release version="1.0.0">
      First Release version of KEAxx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>KEAxx</keyword>
    <keyword>TRK-KEA8</keyword>
    <keyword>TRK-KEA64</keyword>
    <keyword>TRK-KEA128</keyword>
  </keywords>

  <devices>
    <family Dfamily="KEAxx Series" Dvendor="Freescale:78">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
      <book name="Documents\dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>

      <!-- ******************************  SKEAZ128xxx4  ****************************** -->
      <device Dname="SKEAZ128xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\SKEAZ1284.h" define="SKEAZ128xxx4"/>
        <debug svd="SVD\SKEAZ1284.svd"/>
        <memory     id="IROM1"                       start="0x00000000" size="0x20000" startup="1" default="1"/>
        <memory     id="IRAM1"                       start="0x1FFFF000" size="0x4000"              default="1"/>
        <algorithm name="Flash\MKE04Zxxx_P128KB.FLM" start="0x00000000" size="0x20000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

        <book name="Documents\KEA128RM.pdf"         title="SKEAZ128xxx4 Device Reference Manual"/>
        <book name="Documents\SKEA128P80M48SF0.pdf" title="SKEAZ128xxx4 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
  System
  - System integration module (SIM)
  - Power management and mode controllers (PMC)
  - Miscellaneous control module (MCM)
  - Bit manipulation engine (BME)
  - Peripheral bridge (AIPS)
  - Watchdog (WDOG)
  Memories and memory interfaces
  – 128 KB flash
  – 16 KB RAM
  Clocks
  - External crystal oscillator or resonator
  – External square wave input clock
  – Internal clock references
  - Frequency-locked loop (FLL) range: 40–50 MHz
  Security
  - Watchdog (WDOG) with independent clock source
  - Cyclic redundancy check (CRC) module for error detection
  Human-machine interface
  – GPIO
  – Two 8-bit KBI
  – External interrupt (IRQ)
  Analog modules
  – One 12-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  - One 6-channel FlexTimer (FTM) with full function
  - Two 2-channel FTMs with basic TPM function
  - 2-channel periodic interrupt timer (PIT)
  - Real time clock (RTC)
  - One pulse width timer (PWT)
  - System tick timer (SysTick)
  Communication interfaces
  - Two 8-bit SPI
  - Two I2C modules
  - Three UART modules
  - One Freescale's scalable controller area network (MSCAN)
        </description>
      </device>

      <!-- ******************************  SKEAZ64xxx4  ****************************** -->
      <device Dname="SKEAZ64xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\SKEAZ1284.h" define="SKEAZ64xxx4"/>
        <debug svd="SVD\SKEAZ1284.svd"/>
        <memory     id="IROM1"                      start="0x00000000" size="0x10000" startup="1" default="1"/>
        <memory     id="IRAM1"                      start="0x1FFFF800" size="0x2000"              default="1"/>
        <algorithm name="Flash\MKE04Zxxx_P64KB.FLM" start="0x00000000" size="0x10000" RAMstart="0x1FFFF800" RAMsize="0x800" default="1"/>

        <book name="Documents\KEA128RM.pdf"         title="SKEAZ64xxx4 Device Reference Manual"/>
        <book name="Documents\SKEA128P80M48SF0.pdf" title="SKEAZ64xxx4 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
  System
  - System integration module (SIM)
  - Power management and mode controllers (PMC)
  - Miscellaneous control module (MCM)
  - Bit manipulation engine (BME)
  - Peripheral bridge (AIPS)
  - Watchdog (WDOG)
  Memories and memory interfaces
  – 64 KB flash
  –  8 KB RAM
  Clocks
  - External crystal oscillator or resonator
  – External square wave input clock
  – Internal clock references
  - Frequency-locked loop (FLL) range: 40–50 MHz
  Security
  - Watchdog (WDOG) with independent clock source
  - Cyclic redundancy check (CRC) module for error detection
  Human-machine interface
  – GPIO
  – Two 8-bit KBI
  – External interrupt (IRQ)
  Analog modules
  – One 12-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  - One 6-channel FlexTimer (FTM) with full function
  - Two 2-channel FTMs with basic TPM function
  - 2-channel periodic interrupt timer (PIT)
  - Real time clock (RTC)
  - One pulse width timer (PWT)
  - System tick timer (SysTick)
  Communication interfaces
  - Two 8-bit SPI
  - Two I2C modules
  - Three UART modules
  - One Freescale's scalable controller area network (MSCAN)
        </description>
      </device>

      <!-- ******************************  SKEAZN8xxx4  ****************************** -->
      <device Dname="SKEAZN8xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\SKEAZN84.h" define="SKEAZN8xxx4"/>
        <debug svd="SVD\SKEAZN84.svd"/>
        <memory     id="IROM1"                     start="0x00000000" size="0x2000" startup="1" default="1"/>
        <memory     id="IRAM1"                     start="0x1FFFFF00" size="0x400"              default="1"/>
        <algorithm name="Flash\MKE04Zxxx_P8KB.FLM" start="0x00000000" size="0x2000" RAMstart="0x1FFFFF00" RAMsize="0x400" default="1"/>

        <book name="Documents\KEA8RM.pdf"         title="SKEAZN8xxx4 Device Reference Manual"/>
        <book name="Documents\SKEA8P44M48SF0.pdf" title="SKEAZN8xxx4 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
  Operating characteristics
  – Voltage range: 2.7 to 5.5 V
  – Flash write voltage range: 2.7 to 5.5 V
  – Temperature range (ambient): -40 to 125°C
  Memories and memory interfaces
  – 8 KB flash
  – 1 KB RAM
  Clocks
  – Oscillator(OSC) - Range of 31.25 kHz to 39.0625 kHz
    or 4 MHz to 20 MHz
  – Internal clock source (ICS) up to 20 MHz
  – Internal 1 kHz low-power oscillator (LPO)
  System peripherals
  – Power management module (PMC)
  – Low-voltage detection (LVD)
  – Watchdog with independent clock source
  – Programmable cyclic redundancy check module
  – Serial wire debug interface (SWD)
  – Bit manipulation engine (BME)
  Security and integrity modules
  – 80-bit unique identification (ID)
  Human-machine interface
  – Up to 22 GPIO
  – Two 8-bit KBI
  – External interrupt (IRQ)
  Analog modules
  – One 12-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  – One 6-channel FlexTimer/PWM (FTM)
  – Two 2-channel FlexTimer/PWM (FTM)
  – One 2-channel periodic interrupt timer (PIT)
  – One pulse width timer (PWT)
  – One real-time clock (RTC)
  Communication interfaces
  – One SPI modules (SPI)
  – One UART modules (UART)
  – One I2C module (I2C)
  Package options
  – 24-pin QFN
  – 16-pin TSSOP
        </description>
      </device>

      <!-- ******************************  SKEAZN16xxx2  ****************************** -->
      <device Dname="SKEAZN16xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\SKEAZN642.h" define="SKEAZN16xxx2"/>
        <debug svd="SVD\SKEAZN642.svd"/>
        <memory     id="IROM1"                       start="0x00000000" size="0x4000" startup="1" default="1"/>
        <memory     id="IRAM1"                       start="0x1FFFFE00" size="0x800"              default="1"/>
        <algorithm name="Flash\MKE02Zxxx_P16KB.FLM"  start="0x00000000" size="0x4000" RAMstart="0x1FFFFE00" RAMsize="0x800" default="1"/>
        <algorithm name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x100"  RAMstart="0x1FFFFE00" RAMsize="0x800" default="1"/>

