t21/Walnut_X/Packages/.cache/Keil.Kinetis_KEAxx_DFP.1.2.0.pdsc
        <book name="Documents\KEA64RM.pdf"         title="SKEAZN16xxx2 Device Reference Manual"/>
        <book name="Documents\SKEA64P64M20SF0.pdf" title="SKEAZN16xxx2 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
  Operating characteristics
  – Voltage range: 2.7 to 5.5 V
  – Flash write voltage range: 2.7 to 5.5 V
  – Temperature range (ambient): -40 to 125°C
  Memories and memory interfaces
  – 16 KB flash
  – 256 B EEPROM
  – 2 KB RAM
  Clocks
  – Oscillator(OSC) - Range of 31.25 kHz to 39.0625 kHz
    or 4 MHz to 20 MHz
  – Internal clock source (ICS) up to 20 MHz
  – Internal 1 kHz low-power oscillator (LPO)
  System peripherals
  – Power management module (PMC)
  – Low-voltage detection (LVD)
  – Watchdog with independent clock source
  – Programmable cyclic redundancy check module
  – Serial wire debug interface (SWD)
  – Bit manipulation engine (BME)
  Security and integrity modules
  – 64-bit unique identification (ID)
  Human-machine interface
  – Up to 57 GPIO
  – Two 8-bit KBI
  – External interrupt (IRQ)
  Analog modules
  – One 16-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  – One 6-channel FlexTimer/PWM (FTM)
  – Two 2-channel FlexTimer/PWM (FTM)
  – One 2-channel periodic interrupt timer (PIT)
  – One real-time clock (RTC)
  Communication interfaces
  – Two SPI modules (SPI)
  – Three UART modules (UART)
  – One I2C module (I2C)
  Package options
  – 64-pin LQFP
  – 44-pin LQFP
  – 32-pin LQFP
        </description>
      </device>

      <!-- ******************************  SKEAZN32xxx2  ****************************** -->
      <device Dname="SKEAZN32xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\SKEAZN642.h" define="SKEAZN32xxx2"/>
        <debug svd="SVD\SKEAZN642.svd"/>
        <memory     id="IROM1"                       start="0x00000000" size="0x8000" startup="1" default="1"/>
        <memory     id="IRAM1"                       start="0x1FFFFC00" size="0x1000"             default="1"/>
        <algorithm name="Flash\MKE02Zxxx_P32KB.FLM"  start="0x00000000" size="0x8000" RAMstart="0x1FFFFC00" RAMsize="0x800" default="1"/>
        <algorithm name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x100"  RAMstart="0x1FFFFC00" RAMsize="0x800" default="1"/>

        <book name="Documents\KEA64RM.pdf"         title="SKEAZN32xxx2 Device Reference Manual"/>
        <book name="Documents\SKEA64P64M20SF0.pdf" title="SKEAZN32xxx2 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
  Operating characteristics
  – Voltage range: 2.7 to 5.5 V
  – Flash write voltage range: 2.7 to 5.5 V
  – Temperature range (ambient): -40 to 125°C
  Memories and memory interfaces
  – 32 KB flash
  – 256 B EEPROM
  – 4 KB RAM
  Clocks
  – Oscillator(OSC) - Range of 31.25 kHz to 39.0625 kHz
    or 4 MHz to 20 MHz
  – Internal clock source (ICS) up to 20 MHz
  – Internal 1 kHz low-power oscillator (LPO)
  System peripherals
  – Power management module (PMC)
  – Low-voltage detection (LVD)
  – Watchdog with independent clock source
  – Programmable cyclic redundancy check module
  – Serial wire debug interface (SWD)
  – Bit manipulation engine (BME)
  Security and integrity modules
  – 64-bit unique identification (ID)
  Human-machine interface
  – Up to 57 GPIO
  – Two 8-bit KBI
  – External interrupt (IRQ)
  Analog modules
  – One 16-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  – One 6-channel FlexTimer/PWM (FTM)
  – Two 2-channel FlexTimer/PWM (FTM)
  – One 2-channel periodic interrupt timer (PIT)
  – One real-time clock (RTC)
  Communication interfaces
  – Two SPI modules (SPI)
  – Three UART modules (UART)
  – One I2C module (I2C)
  Package options
  – 64-pin LQFP
  – 44-pin LQFP
  – 32-pin LQFP
        </description>
      </device>

      <!-- ******************************  SKEAZN64xxx2  ****************************** -->
      <device Dname="SKEAZN64xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device\Include\SKEAZN642.h" define="SKEAZN64xxx2"/>
        <debug svd="SVD\SKEAZN642.svd"/>
        <memory     id="IROM1"                       start="0x00000000" size="0x10000" startup="1" default="1"/>
        <memory     id="IRAM1"                       start="0x1FFFFC00" size="0x1000"              default="1"/>
        <algorithm name="Flash\MKE02Zxxx_P64KB.FLM"  start="0x00000000" size="0x10000" RAMstart="0x1FFFFC00" RAMsize="0x800" default="1"/>
        <algorithm name="Flash\MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x100"   RAMstart="0x1FFFFC00" RAMsize="0x800" default="1"/>

        <book name="Documents\KEA64RM.pdf"         title="SKEAZN64xxx2 Device Reference Manual"/>
        <book name="Documents\SKEA64P64M20SF0.pdf" title="SKEAZN64xxx2 Device Data Sheet"/>
        <description>
ARM Cortex-M0+ running at up to 48 MHz
  Operating characteristics
  – Voltage range: 2.7 to 5.5 V
  – Flash write voltage range: 2.7 to 5.5 V
  – Temperature range (ambient): -40 to 125°C
  Memories and memory interfaces
  – 64 KB flash
  – 256 B EEPROM
  – 4 KB RAM
  Clocks
  – Oscillator(OSC) - Range of 31.25 kHz to 39.0625 kHz
    or 4 MHz to 20 MHz
  – Internal clock source (ICS) up to 20 MHz
  – Internal 1 kHz low-power oscillator (LPO)
  System peripherals
  – Power management module (PMC)
  – Low-voltage detection (LVD)
  – Watchdog with independent clock source
  – Programmable cyclic redundancy check module
  – Serial wire debug interface (SWD)
  – Bit manipulation engine (BME)
  Security and integrity modules
  – 64-bit unique identification (ID)
  Human-machine interface
  – Up to 57 GPIO
  – Two 8-bit KBI
  – External interrupt (IRQ)
  Analog modules
  – One 16-channel 12-bit SAR ADC
  – Two analog comparators
  Timers
  – One 6-channel FlexTimer/PWM (FTM)
  – Two 2-channel FlexTimer/PWM (FTM)
  – One 2-channel periodic interrupt timer (PIT)
  – One real-time clock (RTC)
  Communication interfaces
  – Two SPI modules (SPI)
  – Three UART modules (UART)
  – One I2C module (I2C)
  Package options
  – 64-pin LQFP
  – 44-pin LQFP
  – 32-pin LQFP
        </description>
      </device>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="SKEAZ128 CMSIS">
      <description>Freescale Kinetis SKEAZ128 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="SKEAZ128xxx4"/>
      <accept Dname="SKEAZ64xxx4"/>
    </condition>

    <condition id="SKEAZN8 CMSIS">
      <description>Freescale Kinetis SKEAZN8 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="SKEAZN8xxx4"/>
    </condition>

    <condition id="SKEAZNxxx2 CMSIS">
      <description>Freescale Kinetis SKEAZN 20MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="SKEAZN16xxx2"/>
      <accept Dname="SKEAZN32xxx2"/>
      <accept Dname="SKEAZN64xxx2"/>
    </condition>
