t21/Walnut_X/Packages/.cache/Keil.Kinetis_KEAxx_DFP.1.2.0.pdsc
  </conditions>

  <components>
    <!-- Startup SKEAZ128 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SKEAZ128 CMSIS">
      <description>System Startup for Freescale Kinetis SKEAZ128 48MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_SKEAZ1284.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_SKEAZ1284.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SKEAZN8 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SKEAZN8 CMSIS">
      <description>System Startup for Freescale Kinetis SKEAZN8 48MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_SKEAZN84.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_SKEAZN84.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SKEAZNxxx2 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SKEAZNxxx2 CMSIS">
      <description>System Startup for Freescale Kinetis SKEAZN 20MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_SKEAZN642.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_SKEAZN642.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- TRK-KEA8 board support -->
    <bundle Cbundle="TRK-KEA8" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale TRK-KEA8 board support</description>
      <doc></doc>
      <component Cgroup="LED" condition="SKEAZN8 CMSIS">
      <description>LED driver for Freescale TRK-KEA8 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TRK-KEA8\Common\LED_TRK-KEA8.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="SKEAZN8 CMSIS">
      <description>Button driver for Freescale TRK-KEA8 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TRK-KEA8\Common\Buttons_TRK-KEA8.c"/>
        </files>
      </component>
    </bundle>

    <!-- TRK-KEA64 board support -->
    <bundle Cbundle="TRK-KEA64" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale TRK-KEA64 board support</description>
      <doc></doc>
      <component Cgroup="LED" condition="SKEAZNxxx2 CMSIS">
      <description>LED driver for Freescale TRK-KEA64 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TRK-KEA64\Common\LED_TRK-KEA64.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="SKEAZNxxx2 CMSIS">
      <description>Button driver for Freescale TRK-KEA64 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TRK-KEA64\Common\Buttons_TRK-KEA64.c"/>
        </files>
      </component>
    </bundle>

    <!-- TRK-KEA128 board support -->
    <bundle Cbundle="TRK-KEA128" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale TRK-KEA128 board support</description>
      <doc></doc>
      <component Cgroup="LED" condition="SKEAZ128 CMSIS">
      <description>LED driver for Freescale TRK-KEA128 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TRK-KEA128\Common\LED_TRK-KEA128.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="SKEAZ128 CMSIS">
      <description>Button driver for Freescale TRK-KEA128 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TRK-KEA128\Common\Buttons_TRK-KEA128.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <!-- TRK-KEA8 board -->
    <board vendor="Freescale" name="TRK-KEA8" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>TRK-KEA8: Kinetis KEA8 StarterTRAK for Low-end Automotive Applications</description>
      <image small="Boards\Freescale\TRK-KEA8\Documentation\TRK-KEA8_small.jpg"/>
      <book category="overview"  name="http://www.freescale.com/TRK-KEA8" title="TRK-KEA8 Web Page"/>
      <book category="schematic" name="Boards\Freescale\TRK-KEA8\Documentation\TRK-KEA8_SCH.pdf"  title="Schematics"/>
      <book category="manual"    name="Boards\Freescale\TRK-KEA8\Documentation\KINTESMCUAUTQSG.pdf" title="Quick Start Guide" />
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="SKEAZN8xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KEAxx Series"/>
      <feature type="Button"    n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="LED"       n="6"              name="LEDs: Power, SDA, 4x User"/>
      <feature type="ConnOther" n="1"              name="LIN Connector"/>
      <feature type="LightSens" n="1"              name="Light Sensor"/>
      <feature type="CustomFF"  n="9"  m="8"       name="Individual Port Access"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="5"  m="12"      name="External Supply"/>
      <feature type="ODbg"      n="1"              name="Onboard OpenSDA via USB"/>
    </board>

    <!-- TRK-KEA64 board -->
    <board vendor="Freescale" name="TRK-KEA64" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>TRK-KEA64: Kinetis KEA64 StarterTRAK with 256B EEPROM</description>
      <image small="Boards\Freescale\TRK-KEA64\Documentation\TRK-KEA64_small.jpg"/>
      <book category="overview"  name="http://www.freescale.com/TRK-KEA64" title="TRK-KEA64 Web Page"/>
      <book category="schematic" name="Boards\Freescale\TRK-KEA64\Documentation\TRK-KEA64_SCH.pdf"  title="Schematics"/>
      <book category="manual"    name="Boards\Freescale\TRK-KEA64\Documentation\KINTESMCUAUTQSG.pdf" title="Quick Start Guide" />
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="SKEAZN64xxx2"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KEAxx Series"/>
      <feature type="Button"    n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="LED"       n="6"              name="LEDs: Power, SDA, 4x User"/>
      <feature type="ConnOther" n="1"              name="LIN Connector"/>
      <feature type="LightSens" n="1"              name="Light Sensor"/>
      <feature type="CustomFF"  n="9"  m="8"       name="Individual Port Access"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="5"  m="12"      name="External Supply"/>
      <feature type="ODbg"      n="1"              name="Onboard OpenSDA via USB"/>
    </board>

    <!-- TRK-KEA128 board -->
    <board vendor="Freescale" name="TRK-KEA128" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>TRK-KEA128: Kinetis KEA128 StarterTRAK for CAN Applications</description>
      <image small="Boards\Freescale\TRK-KEA128\Documentation\TRK-KEA128_small.jpg"/>
      <book category="overview"  name="http://www.freescale.com/TRK-KEA128" title="TRK-KEA128 Web Page"/>
      <book category="schematic" name="Boards\Freescale\TRK-KEA128\Documentation\TRK-KEA128_SCH.pdf"  title="Schematics"/>
      <book category="manual"    name="Boards\Freescale\TRK-KEA128\Documentation\KINTESMCUAUTQSG.pdf" title="Quick Start Guide" />
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="SKEAZ128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KEAxx Series"/>
      <feature type="Button"    n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="LED"       n="6"              name="LEDs: Power, SDA, 4x User"/>
      <feature type="CAN"       n="1"              name="CAN Connector"/>
      <feature type="ConnOther" n="1"              name="LIN Connector"/>
      <feature type="LightSens" n="1"              name="Light Sensor"/>
      <feature type="CustomFF"  n="9"  m="8"       name="Individual Port Access"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="5"  m="12"      name="External Supply"/>
      <feature type="ODbg"      n="1"              name="Onboard OpenSDA via USB"/>
    </board>
  </boards>

  <examples>
    <!-- TRK-KEA8 board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TRK-KEA8\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TRK-KEA8" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA8_Lab1" doc="Abstract.txt" folder="Boards\Freescale\TRK-KEA8\Freescale_Labs\TRK-KEA8_Keil_Lab1">
      <description>TRK-KEA8 Keil LAB1 - Serial communication Interface (UART)</description>
      <board name="TRK-KEA8" vendor="Freescale"/>
      <project>
        <environment name="uv" load="TRK-KEA8_Lab1.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

